mcheah/Marlin4MPMD/MPMD_3dPrinter/Drivers/BSP/STM32F0xx-3dPrinter/stm32f0xx_3dprinter_misc.c
/* Type definition ------------------------------------------------------------*/
typedef struct {
	 uint32_t 		gpioPin;
	 GPIO_TypeDef* 	gpioPort;
	 uint8_t		speed;
	 uint8_t		up_val;
	 uint8_t		count;
	 uint8_t		level; /* Up = 1 ; down = 0 */
	 uint8_t		activePwm;
} tFanStruct;


/* Global variable ------------------------------------------------------------*/
static tFanStruct fanE1;
#ifdef BSP_HEAT_E2_PIN
static tFanStruct fanE2;
static tFanStruct fanE3;
#endif//BSP_HEAT_E2_PIN

/* Imported variables ---------------------------------------------------------*/
extern TIM_HandleTypeDef hTimPwmX;
extern TIM_HandleTypeDef hTimPwmY;
extern TIM_HandleTypeDef hTimPwmZ;
extern TIM_HandleTypeDef hTimPwmE1;
#ifdef BSP_HEAT_E2_PIN
extern TIM_HandleTypeDef hTimPwmE2;
extern TIM_HandleTypeDef hTimPwmE3;
#endif//BSP_HEAT_E2_PIN
/* Private variables ---------------------------------------------------------*/
TIM_HandleTypeDef hTimPwmHeatBed;
#ifdef BSP_HEAT_BED2_PIN
TIM_HandleTypeDef hTimPwmHeatBed2;
TIM_HandleTypeDef hTimPwmHeatBed3;
#endif//BSP_HEAT_BED2_PIN
TIM_HandleTypeDef hTimPwmHeatE1;
#ifdef BSP_HEAT_E2_PIN
TIM_HandleTypeDef hTimPwmHeatE2;
TIM_HandleTypeDef hTimPwmHeatE3;
#endif//BSP_HEAT_E2_PIN
/// Number of motor devices
uint8_t bspMiscNbMotorDevices = 4;

/// Number of the last error
static volatile uint16_t bspMiscLastError;

/// Timer handler for tick
TIM_HandleTypeDef hTimTick;

/// Timer handler for tick2
TIM_HandleTypeDef hTimTick2;


/// Timer handler for servo
TIM_HandleTypeDef hTimServo;

/* Private constant ----------------------------------------------------------*/
static uint8_t bspTickEnabled = 0;

/* Imported function ----------------------------------------------------------*/
void BSP_MiscFlagInterruptHandler(void);
void SystemClock_Config(void);


/** @defgroup  stm32f0XX_3DPRINTER_MOTOR_Public_Functions
  * @{
  */   
/******************************************************//**
 * @brief  Global Init of the motors part of the 3D printer
 * @param[in] nbDevices Number of motor devices to use (from 1 to MAX_NUMBER_OF_DEVICES)
 * @param[in] pReceivedByte pointer to the received byte
 * @retval None
 **********************************************************/
void BSP_MiscOverallInit(uint8_t nbDevices)
{

	/* Init fan struct */
	memset( &fanE1, 0x0, sizeof(tFanStruct));
#ifdef BSP_HEAT_E2_PIN
	memset( &fanE2, 0x0, sizeof(tFanStruct));
	memset( &fanE3, 0x0, sizeof(tFanStruct));
#endif//BSP_HEAT_E2_PIN
   /* STM32xx HAL library initialization */
  HAL_Init();
  
  /* Configure the system clock */
  SystemClock_Config();
  
  /* System interrupt init*/
  /* This part overwrite configuration of priority grouping realized in HAL_Init()
   * Objective is to avoid change in HAL_Init()
   * Due to change in Priority Grouping, the system tick init shall be do again.
   */
  //TODO: check this, stm32F0 does not support priority grouping
  /* Set Interrupt Group Priority */
//  HAL_NVIC_SetPriorityGrouping(NVIC_PRIORITYGROUP_3);
  /* Use systick as time base source and configure 1ms tick (default clock after Reset is HSI) */
  HAL_InitTick(TICK_INT_PRIORITY);
  
  //----- Init of the Motor control library to use nB device */
  bspMiscNbMotorDevices = nbDevices;
#ifdef MOTOR_L6474
  BSP_MotorControl_Init(BSP_MOTOR_CONTROL_BOARD_ID_L6474, nbDevices);
#elif defined(MOTOR_A4985)
  BSP_MotorControl_Init(BSP_MOTOR_CONTROL_BOARD_ID_A4985, nbDevices);
#endif
  
  /* Attach the function MyFlagInterruptHandler (defined below) to the flag interrupt */
//  BSP_MotorControl_AttachFlagInterrupt(BSP_MiscFlagInterruptHandler);

  /* Attach the function Error_Handler (defined below) to the error Handler*/
  BSP_MotorControl_AttachErrorHandler(BSP_MiscErrorHandler); 
}

/******************************************************//**
 * @brief  Handler of the motor flag interrupt
 * @param None
 * @retval None
 **********************************************************/
void BSP_MiscFlagInterruptHandler(void)
{
  uint16_t statusRegister;
  uint8_t loop;
  
  for (loop =0; loop < bspMiscNbMotorDevices; loop++)
  {
    /* Get the value of the status register via the L6474 command GET_STATUS */
    statusRegister = BSP_MotorControl_CmdGetStatus(loop);
#ifdef MOTOR_L6474
    /* Check HIZ flag: if set, power brigdes are disabled */
    if ((statusRegister & L6474_STATUS_HIZ) == L6474_STATUS_HIZ)
    {
      // HIZ state
      // Action to be customized            
    }

    /* Check direction bit */
    if ((statusRegister & L6474_STATUS_DIR) == L6474_STATUS_DIR)
    {
      // Forward direction is set
      // Action to be customized            
    }  
    else
    {
      // Backward direction is set
      // Action to be customized            
    }  

    /* Check NOTPERF_CMD flag: if set, the command received by SPI can't be performed */
    /* This often occures when a command is sent to the L6474 */
    /* while it is in HIZ state */
    if ((statusRegister & L6474_STATUS_NOTPERF_CMD) == L6474_STATUS_NOTPERF_CMD)
    {
        // Command received by SPI can't be performed
       // Action to be customized            
    }  

    /* Check WRONG_CMD flag: if set, the command does not exist */
    if ((statusRegister & L6474_STATUS_WRONG_CMD) == L6474_STATUS_WRONG_CMD)
    {
       //command received by SPI does not exist 
       // Action to be customized          
    }  

    /* Check UVLO flag: if not set, there is an undervoltage lock-out */
    if ((statusRegister & L6474_STATUS_UVLO) == 0)
    {
       //undervoltage lock-out 
       // Action to be customized          
    }  

    /* Check TH_WRN flag: if not set, the thermal warning threshold is reached */
    if ((statusRegister & L6474_STATUS_TH_WRN) == 0)
    {
      //thermal warning threshold is reached
      // Action to be customized          
    }    

    /* Check TH_SHD flag: if not set, the thermal shut down threshold is reached */
    if ((statusRegister & L6474_STATUS_TH_SD) == 0)
    {
      //thermal shut down threshold is reached 
      // Action to be customized          
    }    

