mcheah/Marlin4MPMD/MPMD_3dPrinter/Drivers/BSP/STM32F0xx-3dPrinter/stm32f0xx_3dprinter_misc.c
    /* Check OCD  flag: if not set, there is an overcurrent detection */
    if ((statusRegister & L6474_STATUS_OCD) == 0)
    {
      //overcurrent detection 
      // Action to be customized          
    }
#endif
  }
}


/******************************************************//**
 * @brief  General error handler
 * @param None
 * @retval None
 **********************************************************/
void BSP_MiscErrorHandler(uint16_t error)
{
  static char errorTxt[15] = "Error = 0x";
  char* errorTxtPtr;
  errorTxtPtr = errorTxt + strlen(errorTxt);
  /* Backup error number */
  bspMiscLastError = error;
  sprintf(errorTxtPtr, "%x\r\n",error);
  
  
  /* Disable heater */
#ifndef MARLIN
  BSP_MiscHeatPwmSetDutyCycle(0, 0);
  BSP_MiscHeatPwmSetDutyCycle(1, 0);
#else  
  BSP_MiscHeatManualInit(0);
  BSP_MiscHeatManualInit(1);
  BSP_MiscHeatManualInit(2);
  BSP_MiscHeatManualInit(3);
#endif  
  
  
  BSP_UartLockingTx((uint8_t *)&errorTxt, sizeof(errorTxt));
  
  /* Infinite loop */
  while(1)
  {
  }
}
/******************************************************//**
 * @brief  Initialisation of the Z probe
 * @param None
 * @retval None
 **********************************************************/
void BSP_MiscInitZProbeInit(void)
{
  GPIO_InitTypeDef GPIO_InitStruct;
  
  /* Configure IR_ON pin */
  GPIO_InitStruct.Pin = BSP_IR_ON_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_MEDIUM;
  HAL_GPIO_Init(BSP_IR_ON_PORT, &GPIO_InitStruct);
  
}

/******************************************************//**
 * @brief  Enabling of the Z probe
 * @param[in] enable 0 to disable, 1 to enable
 * @retval None
 **********************************************************/
void BSP_MiscInitZProbeEnable(uint8_t enable)
{
  if (enable == 0)  
  {
    HAL_GPIO_WritePin(BSP_IR_ON_PORT, BSP_IR_ON_PIN, GPIO_PIN_RESET); 
  }
  else
  {
    HAL_GPIO_WritePin(BSP_IR_ON_PORT, BSP_IR_ON_PIN, GPIO_PIN_SET); 
  }
}

/******************************************************//**
 * @brief  Initialisation of the stops
 * @param[in] id 0 for X_Stop, 1 for Y_Stop, 2 for Z_Stop
 * @retval None
 **********************************************************/
void BSP_MiscStopInit(uint8_t id)
{
  GPIO_InitTypeDef GPIO_InitStruct;
  uint32_t gpioPin;
  GPIO_TypeDef* gpioPort;

  switch (id)
  {
    case 0:
      /* Configure X_STOP pin */
      gpioPin = BSP_STOP_X_PIN;
      gpioPort = BSP_STOP_X_PORT;    
#if defined(STOP_X__PULL_UP)
      GPIO_InitStruct.Pull = GPIO_PULLUP;
#else
      GPIO_InitStruct.Pull = GPIO_PULLDOWN;
#endif
      break;
    case 1:
      /* Configure Y_STOP pin */
      gpioPin = BSP_STOP_Y_PIN;
      gpioPort = BSP_STOP_Y_PORT;    
#if defined(STOP_Y__PULL_UP)
      GPIO_InitStruct.Pull = GPIO_PULLUP;
#else
      GPIO_InitStruct.Pull = GPIO_PULLDOWN;
#endif
      break;      
    case 2:
      /* Configure Z_STOP pin */
      gpioPin = BSP_STOP_Z_PIN;
      gpioPort = BSP_STOP_Z_PORT;
#if defined(STOP_Z__PULL_UP)
      GPIO_InitStruct.Pull = GPIO_PULLUP;
#else
      GPIO_InitStruct.Pull = GPIO_PULLDOWN;
#endif
      break;   
//TODO: make this a conditional compile
//    case 3:
//      /* Configure U_STOP pin */
//      gpioPin = BSP_STOP_U_PIN;
//      gpioPort = BSP_STOP_U_PORT;
//#ifndef MARLIN
//      GPIO_InitStruct.Pull = GPIO_PULLDOWN;
//#else
//      GPIO_InitStruct.Pull = GPIO_PULLUP;
//#endif
//      break;
//    case 4:
//      /* Configure V_STOP pin */
//      gpioPin = BSP_STOP_V_PIN;
//      gpioPort = BSP_STOP_V_PORT;
//#ifndef MARLIN
//      GPIO_InitStruct.Pull = GPIO_PULLDOWN;
//#else
//      GPIO_InitStruct.Pull = GPIO_PULLUP;
//#endif
//      break;
//    case 5:
//      /* Configure W_STOP pin */
//      gpioPin = BSP_STOP_W_PIN;
//      gpioPort = BSP_STOP_W_PORT;
//#ifndef MARLIN
//      GPIO_InitStruct.Pull = GPIO_PULLDOWN;
//#else
//      GPIO_InitStruct.Pull = GPIO_PULLUP;
//#endif
      break;        
    default:
      return;
  }
  GPIO_InitStruct.Pin = gpioPin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_MEDIUM;
  HAL_GPIO_Init(gpioPort, &GPIO_InitStruct);      
}

/******************************************************//**
 * @brief  Get Stop status
 * @param[in] id 0 for X_Stop, 1 for Y_Stop, 2 for Z_Stop
  * @retval status 0 if GPIO is set, 1 if it reset
 **********************************************************/
uint8_t BSP_MiscStopGetStatus(uint8_t id)
{
  uint32_t gpioPin;
  GPIO_TypeDef* gpioPort;
  uint8_t status = 0;
  
  switch (id)
  {
    case 0:
      /* Configure X_STOP pin */
      gpioPin = BSP_STOP_X_PIN;
      gpioPort = BSP_STOP_X_PORT;    
      break;
    case 1:
      /* Configure Y_STOP pin */
      gpioPin = BSP_STOP_Y_PIN;
      gpioPort = BSP_STOP_Y_PORT;    
      break;      
    case 2:
      /* Configure Z_STOP pin */
      gpioPin = BSP_STOP_Z_PIN;
      gpioPort = BSP_STOP_Z_PORT;    
      break;   
    default:
      return (status);
  }
  status = !((uint8_t) HAL_GPIO_ReadPin(gpioPort, gpioPin)); 
  return (status);
}

/******************************************************//**
 * @brief  Initialisation of the Heats
 * @param[in] id 0 for E1_FAN, 1 for E2, 2 for E3, 3 for E4
 * @retval None
 **********************************************************/
void BSP_MiscFanInit(uint8_t id)
{
  GPIO_InitTypeDef GPIO_InitStruct;
  uint32_t gpioPin;
  GPIO_TypeDef* gpioPort;
  tFanStruct* pfan;

  switch (id)
  {
    case 0:
    	/* Configure E1 Fan pin */
    	gpioPin  = BSP_FAN_E1_PIN;
    	gpioPort = BSP_FAN_E1_PORT;
    	pfan = &fanE1;
      break;
#ifdef BSP_FAN_E2_PIN
    case 1:
      /* Configure E2 Fan pin */
    	gpioPin  = BSP_FAN_E2_PIN;
    	gpioPort = BSP_FAN_E2_PORT;
    	pfan = &fanE2;
      break;      
    case 2:
      /* Configure E3 Fan pin */
    	gpioPin  = BSP_FAN_E3_PIN;
    	gpioPort = BSP_FAN_E3_PORT;
    	pfan = &fanE3;
      break;   
#endif
    default:
      return;
  }

  GPIO_InitStruct.Pin = gpioPin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_MEDIUM;
  HAL_GPIO_Init(gpioPort, &GPIO_InitStruct);

  pfan->gpioPin  = gpioPin;
  pfan->gpioPort = gpioPort;
  pfan->activePwm   = 0;
}

/******************************************************//**
 * @brief  Initialisation of the Heats
 * @param[in] id 0 for E1_FAN, 1 for E2, 2 for E3, 3 for E4
 * @param[in] speed from 0 (min speed) to 255 (full speed) 
 * @retval None
 **********************************************************/
void BSP_MiscFanSetSpeed(uint8_t id,uint8_t speed)
{
	tFanStruct* pfan;

