mcheah/Marlin4MPMD/MPMD_3dPrinter/Drivers/BSP/STM32F0xx-3dPrinter/stm32f0xx_3dprinter_misc.c
#ifndef MARLIN
	speed = 255; // Force speed to never stop the fan !!!
#endif 
 
	if ( (speed>0) && (speed<50) )
		speed = 50;

	if( id == 0)
    	/* Configure E1 Fan */
    	pfan = &fanE1;
#ifdef BSP_HEAT_E2_PIN
	else if ( id == 1)
    	/* Configure E2 Fan */
    	pfan = &fanE2;
	else if ( id == 2)
		/* Configure E3 Fan */
	    pfan = &fanE3;
#endif//BSP_HEAT_E2_PIN
	else // Error case
		return;
  
  if (speed == 0)
  {
     HAL_GPIO_WritePin(pfan->gpioPort, pfan->gpioPin, GPIO_PIN_RESET);
     pfan->activePwm = 0;
     pfan->speed = speed;
  }
  else if (speed == 255)
  {
     HAL_GPIO_WritePin(pfan->gpioPort, pfan->gpioPin, GPIO_PIN_SET);
     pfan->activePwm = 0;
     pfan->speed = speed;
  }
  /* Else : PWM */
  else if( speed != pfan->speed)
  {
	  //HAL_GPIO_WritePin(pfan->gpioPort, pfan->gpioPin, GPIO_PIN_SET);
	  pfan->speed = speed;
	  pfan->up_val = (uint8_t)(speed / 5) - 1;
	  pfan->count = pfan->up_val;
	  pfan->level = 1; /* Up state*/
	  pfan->activePwm = 1;
  }
}


/******************************************************//**
 * @brief  Management of the Heats under IT
 * @param[in] None
 * @retval None
 **********************************************************/
void HAL_SYSTICK_Callback(void)
{
	if( fanE1.activePwm)
	{
		fanE1.count--;

		if( !fanE1.count)
		{
			if(fanE1.level) /* signal level was high */
			{
				HAL_GPIO_WritePin(fanE1.gpioPort, fanE1.gpioPin, GPIO_PIN_RESET);
				fanE1.count = 50 - fanE1.up_val;
				fanE1.level = 0;
			}
			else/* signal level was low */
			{
				HAL_GPIO_WritePin(fanE1.gpioPort, fanE1.gpioPin, GPIO_PIN_SET);
				fanE1.count = fanE1.up_val;
				fanE1.level = 1;
			}
		}
	}
#ifdef BSP_HEAT_E2_PIN
	else if( fanE2.activePwm)
	{
		fanE2.count--;
		if( fanE2.count > 0)
		{
			if(fanE2.level) /* signal level was high */
			{
				HAL_GPIO_WritePin(fanE2.gpioPort, fanE2.gpioPin, GPIO_PIN_RESET);
				fanE2.count = 100 - fanE2.up_val;
				fanE2.level = 0;
			}
			else/* signal level was low */
			{
				HAL_GPIO_WritePin(fanE2.gpioPort, fanE2.gpioPin, GPIO_PIN_SET);
				fanE2.count = fanE2.up_val;
				fanE2.level = 1;
			}
		}
	}
	else if( fanE3.activePwm)
	{
		fanE3.count--;
		if( fanE3.count > 0)
		{
			if(fanE3.level) /* signal level was high */
			{
				HAL_GPIO_WritePin(fanE3.gpioPort, fanE3.gpioPin, GPIO_PIN_RESET);
				fanE3.count = 100 - fanE3.up_val;
				fanE3.level = 0;
			}
			else/* signal level was low */
			{
				HAL_GPIO_WritePin(fanE3.gpioPort, fanE3.gpioPin, GPIO_PIN_SET);
				fanE3.count = fanE3.up_val;
				fanE3.level = 1;
			}
		}
	}
#endif//BSP_HEAT_E2_PIN

}


/******************************************************//**
 * @brief  Initialisation of the Tick timer 
 * @param None
  * @retval None
 **********************************************************/
void BSP_MiscTickInit(void)
{
  TIM_OC_InitTypeDef sConfigOC;
  TIM_MasterConfigTypeDef sMasterConfig;
#ifndef MARLIN
  hTimTick.Instance = BSP_MISC_TIMER_TICK;
  hTimTick.Init.Prescaler = TICK_TIMER_PRESCALER - 1;
  hTimTick.Init.CounterMode = TIM_COUNTERMODE_UP;
  hTimTick.Init.Period = 0;
  hTimTick.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  HAL_TIM_OC_Init(&hTimTick);

  sConfigOC.OCMode = TIM_OCMODE_TIMING;
  sConfigOC.Pulse = 0;
  sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
  HAL_TIM_OC_ConfigChannel(&hTimTick, &sConfigOC, BSP_MISC_CHAN_TIMER_TICK);

  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  HAL_TIMEx_MasterConfigSynchronization(&hTimTick, &sMasterConfig);
#else //#ifndef MARLIN
  hTimTick.Instance = BSP_MISC_TIMER_TICK;
  hTimTick.Init.Prescaler = TICK_TIMER_PRESCALER - 1;
  hTimTick.Init.CounterMode = TIM_COUNTERMODE_UP;
  //TODO: all timers on STM32F070 are 16-bit
//  if ((hTimTick.Instance != TIM2) && (hTimTick.Instance != TIM5))
//  {
    hTimTick.Init.Period = 0xFFFF;
//  }
//  else
//  {
//    hTimTick.Init.Period = 0xFFFFFFFF;
//  }
  //TODO: check this, unclear what's special about TIM4, it seems all timer's can handle this
  hTimTick.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
//  if (hTimTick.Instance != TIM4)
//  {
    sConfigOC.OCMode = TIM_OCMODE_TOGGLE;
//  }
//  else
//  {
//    sConfigOC.OCMode = TIM_OCMODE_TIMING;
//  }
  sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH; 
  sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
  sConfigOC.Pulse = 0;
  
  HAL_TIM_OC_Init(&hTimTick);
  HAL_TIM_OC_ConfigChannel(&hTimTick, &sConfigOC, BSP_MISC_CHAN_TIMER_TICK);

  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  HAL_TIMEx_MasterConfigSynchronization(&hTimTick, &sMasterConfig);
#endif //else #ifndef MARLIN
}


/******************************************************//**
 * @brief  Sets the frequency of PWM_X used by device 0
 * @param[in] newPeriod in seconds
 * @retval None
 * @note The frequency is directly the current speed of the device
 **********************************************************/
void BSP_MiscTickSetFreq(uint32_t newFreq)
{
#ifndef MARLIN
    uint32_t sysFreq = HAL_RCC_GetSysClockFreq();
  uint32_t tick;
  uint32_t timPeriod = ((uint32_t)(sysFreq * newPeriod)/ TICK_TIMER_PRESCALER) - 1; 
  
  
  __HAL_TIM_SetAutoreload(&hTimTick, timPeriod);
  __HAL_TIM_SetCompare(&hTimTick, BSP_MISC_CHAN_TIMER_TICK, timPeriod >> 1);
  HAL_TIM_PWM_Start_IT(&hTimTick, BSP_MISC_CHAN_TIMER_TICK);  
  
  tick = __HAL_TIM_GetCounter(&hTimTick);
  if (timPeriod < tick)
  {
    __HAL_TIM_SetCounter(&hTimTick,0); //To prevent tick overlap workaround
  }
#else //#ifndef MARLIN

  uint32_t timPeriod;
  uint32_t timerCnt = hTimTick.Instance->CNT;
  if(newFreq > 10000) { 
    // If newFreq > 20kHz >> step 4 times
    newFreq = (newFreq >> 2)&0x3fff;
  }
  else if(newFreq > 5000) 
  { 
    // If newFreq > 10kHz >> step 2 times
    newFreq = (newFreq >> 1)&0x7fff;
  }
  
  timPeriod = (HAL_RCC_GetSysClockFreq()/ (TICK_TIMER_PRESCALER * (uint32_t)newFreq));
  if (timPeriod < 100) timPeriod = 100;
  
  __HAL_TIM_SetCompare(&hTimTick, BSP_MISC_CHAN_TIMER_TICK, timerCnt + timPeriod);
  
  if (bspTickEnabled == 0)
  {
     if ((BSP_MISC_CHAN_TIMER_TICK) == (TIM_CHANNEL_1))
    {
      __HAL_TIM_CLEAR_IT(&hTimTick, TIM_IT_CC1);
    }
    else if (BSP_MISC_CHAN_TIMER_TICK == TIM_CHANNEL_2)
    {
      __HAL_TIM_CLEAR_IT(&hTimTick, TIM_IT_CC2);
    }
    else if (BSP_MISC_CHAN_TIMER_TICK == TIM_CHANNEL_3)
    {
      __HAL_TIM_CLEAR_IT(&hTimTick, TIM_IT_CC3);
    }
    else if (BSP_MISC_CHAN_TIMER_TICK == TIM_CHANNEL_4)
    {
      __HAL_TIM_CLEAR_IT(&hTimTick, TIM_IT_CC4);
    }
    HAL_TIM_OC_Start_IT(&hTimTick,BSP_MISC_CHAN_TIMER_TICK);  
    bspTickEnabled = 1; 
  }
#endif //else #ifndef MARLIN  
}

/******************************************************//**
 * @brief  Sets the frequency of PWM_X used by device 0
 * @param[in] newPeriod in seconds
 * @retval None
 * @note The frequency is directly the current speed of the device
 **********************************************************/
void BSP_MiscTickSetPeriod(uint32_t newTimPeriod)
{
  uint32_t timerCnt = hTimTick.Instance->CNT + newTimPeriod;
  __HAL_TIM_SetCompare(&hTimTick, BSP_MISC_CHAN_TIMER_TICK, timerCnt);
    
