mcheah/Marlin4MPMD/MPMD_3dPrinter/Drivers/BSP/STM32F0xx-3dPrinter/stm32f0xx_3dprinter_misc.c
}
/******************************************************//**
 * @brief  Stop the PWM used for the tick
 * @param[in] None
 * @retval None
  **********************************************************/
void BSP_MiscTickStop(void)
{
  HAL_TIM_PWM_Stop_IT(&hTimTick,BSP_MISC_CHAN_TIMER_TICK);  
  bspTickEnabled = 0;
}

/******************************************************//**
 * @brief  Initialisation of the Tick2 timer 
 * @param None
  * @retval None
 **********************************************************/
void BSP_MiscTick2Init(void)
{
  TIM_OC_InitTypeDef sConfigOC;
  TIM_MasterConfigTypeDef sMasterConfig;

  hTimTick2.Instance = BSP_MISC_TIMER_TICK2;
  hTimTick2.Init.Prescaler = TICK_TIMER_PRESCALER - 1;
  hTimTick2.Init.CounterMode = TIM_COUNTERMODE_UP;
  hTimTick2.Init.Period = 0;
  hTimTick2.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  HAL_TIM_OC_Init(&hTimTick2);

  sConfigOC.OCMode = TIM_OCMODE_TIMING;
  sConfigOC.Pulse = 0;
  sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
  HAL_TIM_OC_ConfigChannel(&hTimTick2, &sConfigOC, BSP_MISC_CHAN_TIMER_TICK2);

  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  HAL_TIMEx_MasterConfigSynchronization(&hTimTick2, &sMasterConfig);

}


/******************************************************//**
 * @brief  Sets the frequency of PWM_X used by device 0
 * @param[in] newPeriod in seconds
 * @retval None
 * @note The frequency is directly the current speed of the device
 **********************************************************/
void BSP_MiscTick2SetFreq(float newPeriod)
{
  uint32_t sysFreq = HAL_RCC_GetSysClockFreq();
  uint32_t tick;
  uint32_t timPeriod = ((uint32_t)(sysFreq * newPeriod)/ TICK_TIMER_PRESCALER) - 1; 
  
  __HAL_TIM_SetAutoreload(&hTimTick2, timPeriod);
  __HAL_TIM_SetCompare(&hTimTick2, BSP_MISC_CHAN_TIMER_TICK2, timPeriod >> 1);
  HAL_TIM_PWM_Start_IT(&hTimTick2, BSP_MISC_CHAN_TIMER_TICK2);  
  
  tick = __HAL_TIM_GetCounter(&hTimTick2);
  if (timPeriod < tick)
  {
    __HAL_TIM_SetCounter(&hTimTick2,0); //To prevent tick overlap workaround
  }
}
/******************************************************//**
 * @brief  Stop the PWM used for the tick2
 * @param[in] None
 * @retval None
  **********************************************************/
void BSP_MiscTick2Stop(void)
{
  HAL_TIM_PWM_Stop_IT(&hTimTick2,BSP_MISC_CHAN_TIMER_TICK2);  
}

/******************************************************//**
 * @brief  Sets SW step clock mode (where step clocks are
 * not handled through HW PWMs but commutated by SW
 * @param None
 * @retval None
**********************************************************/
void BSP_MiscSetStepClockToSwMode(void)
{
  TIM_HandleTypeDef *pHTim;
  GPIO_InitTypeDef GPIO_InitStruct;
  uint8_t deviceId;
  uint32_t gpioPin;
  GPIO_TypeDef* gpioPort;  
  
  for (deviceId = 0; deviceId < bspMiscNbMotorDevices; deviceId++) 
  {
    switch (deviceId)
    {
      case 0:
      default:
        pHTim = &hTimPwmX;
        pHTim->Instance = BSP_MOTOR_CONTROL_BOARD_TIMER_PWM_X;
        gpioPin = BSP_MOTOR_CONTROL_BOARD_PWM_X_PIN;
        gpioPort = BSP_MOTOR_CONTROL_BOARD_PWM_X_PORT;
        break;
      case  1:
        pHTim = &hTimPwmY;
        pHTim->Instance = BSP_MOTOR_CONTROL_BOARD_TIMER_PWM_Y;
        gpioPin = BSP_MOTOR_CONTROL_BOARD_PWM_Y_PIN;
        gpioPort = BSP_MOTOR_CONTROL_BOARD_PWM_Y_PORT;        
        break;
      case 2:
        pHTim = &hTimPwmZ;
        pHTim->Instance = BSP_MOTOR_CONTROL_BOARD_TIMER_PWM_Z;
        gpioPin = BSP_MOTOR_CONTROL_BOARD_PWM_Z_PIN;
        gpioPort = BSP_MOTOR_CONTROL_BOARD_PWM_Z_PORT;           
        break;
      case 3:
        pHTim = &hTimPwmE1;
        pHTim->Instance = BSP_MOTOR_CONTROL_BOARD_TIMER_PWM_E1;
        gpioPin = BSP_MOTOR_CONTROL_BOARD_PWM_E1_PIN;
        gpioPort = BSP_MOTOR_CONTROL_BOARD_PWM_E1_PORT;            
        break;
#ifdef BSP_HEAT_E2_PIN
      case 4:
        pHTim = &hTimPwmE2;
        pHTim->Instance = BSP_MOTOR_CONTROL_BOARD_TIMER_PWM_E2;
        gpioPin = BSP_MOTOR_CONTROL_BOARD_PWM_E2_PIN;
        gpioPort = BSP_MOTOR_CONTROL_BOARD_PWM_E2_PORT;             
        break;
      case 5:
        pHTim = &hTimPwmE3;
        pHTim->Instance = BSP_MOTOR_CONTROL_BOARD_TIMER_PWM_E3;
        gpioPin = BSP_MOTOR_CONTROL_BOARD_PWM_E3_PIN;
        gpioPort = BSP_MOTOR_CONTROL_BOARD_PWM_E3_PORT;            
        break;
#endif//BSP_HEAT_E2_PIN
    }
    HAL_TIM_PWM_DeInit(pHTim);
  
  /* GPIO configuration */
    GPIO_InitStruct.Pin = gpioPin;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_MEDIUM;
    HAL_GPIO_Init(gpioPort, &GPIO_InitStruct);    
    HAL_GPIO_WritePin(gpioPort, gpioPin, GPIO_PIN_RESET); 

  }
}
/******************************************************//**
 * @brief Generate a step clock pulse
 * @param None
 * @retval None
**********************************************************/
void BSP_MiscGenerateStepClockPulse(uint8_t deviceId)
{
  uint32_t gpioPin;
  GPIO_TypeDef* gpioPort;  

  switch (deviceId)
  {
    case 0:
    default:
      gpioPin = BSP_MOTOR_CONTROL_BOARD_PWM_Z_PIN;
      gpioPort = BSP_MOTOR_CONTROL_BOARD_PWM_Z_PORT; 
      break;
    case  1:
      gpioPin = BSP_MOTOR_CONTROL_BOARD_PWM_Y_PIN;
      gpioPort = BSP_MOTOR_CONTROL_BOARD_PWM_Y_PORT;        
      break;
    case 2:
      gpioPin = BSP_MOTOR_CONTROL_BOARD_PWM_X_PIN;
      gpioPort = BSP_MOTOR_CONTROL_BOARD_PWM_X_PORT;         
      break;
    case 3:
      gpioPin = BSP_MOTOR_CONTROL_BOARD_PWM_E1_PIN;
      gpioPort = BSP_MOTOR_CONTROL_BOARD_PWM_E1_PORT;            
      break;
#ifdef BSP_HEAT_E2_PIN
    case 4:
      gpioPin = BSP_MOTOR_CONTROL_BOARD_PWM_E2_PIN;
      gpioPort = BSP_MOTOR_CONTROL_BOARD_PWM_E2_PORT;             
      break;
    case 5:
      gpioPin = BSP_MOTOR_CONTROL_BOARD_PWM_E3_PIN;
      gpioPort = BSP_MOTOR_CONTROL_BOARD_PWM_E3_PORT;            
      break;
#endif//BSP_HEAT_E2_PIN
  }  
  
  HAL_GPIO_WritePin(gpioPort, gpioPin, GPIO_PIN_SET); 
  HAL_GPIO_WritePin(gpioPort, gpioPin, GPIO_PIN_RESET); 
}
                                    
 /******************************************************//**
 * @brief Generate a step clock pulse
 * @param[in] device Id 
 * @param[in] current value in mA
 * @retval None
**********************************************************/
void BSP_MiscSetOcdThreshold(uint8_t deviceId, uint32_t current)
{
  int32_t currentThreshold = 375;
  uint32_t ocdThresholdParam = 0;
  //TODO:check functionality that this actually still does hwat it's supposed to
#ifdef MOTOR_L6474
  while ((current >= currentThreshold) && (ocdThresholdParam < L6474_OCD_TH_6000mA))
  {
    currentThreshold += 375;
    ocdThresholdParam++;
  }
  
  BSP_MotorControl_CmdSetParam(deviceId, L6474_OCD_TH, ocdThresholdParam);   
#endif
}

/******************************************************//**
 * @brief  Initialises the Gpios uses by the specified Heats
 * @param[in] heatId (from 0 to 4)
 * @retval None
 * @note 0 for bead heat, 1 for E1 heat, 2 for E2 heat...
 **********************************************************/
void BSP_MiscHeatManualInit(uint8_t heatId)
{
  uint32_t gpioPin;
  GPIO_TypeDef* gpioPort;  
  GPIO_InitTypeDef GPIO_InitStruct;
  
  switch (heatId)
  {
    case 0:
      gpioPin = BSP_HEAT_BED1_PIN;
      gpioPort = BSP_HEAT_BED1_PORT; 
      break;
    case  1:
      gpioPin = BSP_HEAT_E1_PIN;
      gpioPort = BSP_HEAT_E1_PORT; 
      break;
#ifdef BSP_HEAT_E2_PIN
    case 2:
      gpioPin = BSP_HEAT_E2_PIN;
      gpioPort = BSP_HEAT_E2_PORT; 
      break;
    case 3:
      gpioPin = BSP_HEAT_E3_PIN;
      gpioPort = BSP_HEAT_E3_PORT; 
      break;
#endif//BSP_HEAT_E2_PIN
#ifdef BSP_HEAT_BED2_PIN
    case 5:
      gpioPin = BSP_HEAT_BED2_PIN;
      gpioPort = BSP_HEAT_BED2_PORT; 
      break;
    case 6:
      gpioPin = BSP_HEAT_BED3_PIN;
      gpioPort = BSP_HEAT_BED3_PORT; 
      break;
#endif//BSP_HEAT_BED2_PIN
    default:
    	return;
  }
  /* GPIO configuration */
    GPIO_InitStruct.Pin = gpioPin;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_MEDIUM;
    HAL_GPIO_Init(gpioPort, &GPIO_InitStruct);    
    HAL_GPIO_WritePin(gpioPort, gpioPin, GPIO_PIN_RESET); 
}

/******************************************************//**
 * @brief  Initialises the PWM uses by the specified Heats
 * @param[in] heatId (from 0 to 4)
 * @retval None
 * @note 0 for bead heat, 1 for E1 heat, 2 for E2 heat...
 **********************************************************/
void BSP_MiscHeatPwmInit(uint8_t heatId)
{
  TIM_OC_InitTypeDef sConfigOC;
  TIM_MasterConfigTypeDef sMasterConfig;
  TIM_HandleTypeDef *pHTim;
  uint32_t  channel;
  uint32_t sysFreq = HAL_RCC_GetSysClockFreq();
  uint32_t period;
  
  switch (heatId)
  {
    case 0:
    default:
      pHTim = &hTimPwmHeatBed;
      pHTim->Instance = BSP_MISC_TIMER_PWM_HEAT_BED;
      channel = BSP_MISC_CHAN_TIMER_PWM_HEAT_BED;
      break;
    case  1:
      pHTim = &hTimPwmHeatE1;
      pHTim->Instance = BSP_MISC_TIMER_PWM_HEAT_E1;
      channel = BSP_MISC_CHAN_TIMER_PWM_HEAT_E1;
      break;
#ifdef BSP_HEAT_E2_PIN
    case 2:
      pHTim = &hTimPwmHeatE2;
      pHTim->Instance = BSP_MISC_TIMER_PWM_HEAT_E2;
      channel = BSP_MISC_CHAN_TIMER_PWM_HEAT_E2;
      break;
    case 3:
      pHTim = &hTimPwmHeatE3;
      pHTim->Instance = BSP_MISC_TIMER_PWM_HEAT_E3;
      channel = BSP_MISC_CHAN_TIMER_PWM_HEAT_E3;
      break;
#endif//BSP_HEAT_E2_PIN
#ifdef BSP_HEAT_BED2_PIN
    case 5:
      pHTim = &hTimPwmHeatBed2;
      pHTim->Instance = BSP_MISC_TIMER_PWM_HEAT_BED2;
      channel = BSP_MISC_CHAN_TIMER_PWM_HEAT_BED2;
      break;
    case 6:
      pHTim = &hTimPwmHeatBed3;
      pHTim->Instance = BSP_MISC_TIMER_PWM_HEAT_BED3;
      channel = BSP_MISC_CHAN_TIMER_PWM_HEAT_BED3;
      break;
#endif//BSP_HEAT_BED2_PIN
  }
  period = (sysFreq/ (HEAT_TIMER_PRESCALER * HEAT_TIMER_FREQUENCY)) - 1;
  
  pHTim->Init.Prescaler = HEAT_TIMER_PRESCALER -1;
  pHTim->Init.CounterMode = TIM_COUNTERMODE_UP;
  pHTim->Init.Period = period;
  pHTim->Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  HAL_TIM_PWM_Init(pHTim);
  
