mcheah/Marlin4MPMD/MPMD_3dPrinter/Drivers/BSP/STM32F0xx-3dPrinter/stm32f0xx_3dprinter_misc.c
  sConfigOC.OCMode = TIM_OCMODE_PWM1;
  sConfigOC.Pulse = 0;
  sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
  sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
  HAL_TIM_PWM_ConfigChannel(pHTim, &sConfigOC, channel);
  
  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  HAL_TIMEx_MasterConfigSynchronization(pHTim, &sMasterConfig);
  
  HAL_TIM_PWM_Start(pHTim, channel);    
  
}
                                    
/******************************************************//**
 * @brief  Initialises the PWM uses by the specified Heats
 * @param[in] heatId (from 0 to 4)
 * @param[in] newDuty from 0 to 255
 * @retval None
 * @note 0 for bead heat, 1 for E1 heat, 2 for E2 heat...
 **********************************************************/
void BSP_MiscHeatPwmSetDutyCycle(uint8_t heatId, uint8_t newDuty)
{
  TIM_HandleTypeDef *pHTim;
  uint32_t  channel;
  uint32_t pulse;
  
  switch (heatId)
  {
  case 0:
  default:
      pHTim = &hTimPwmHeatBed;
      channel = BSP_MISC_CHAN_TIMER_PWM_HEAT_BED;
      break;
    case  1:
      pHTim = &hTimPwmHeatE1;
      channel = BSP_MISC_CHAN_TIMER_PWM_HEAT_E1;
      break;
#ifdef BSP_HEAT_E2_PIN
    case 2:
      pHTim = &hTimPwmHeatE2;
      channel = BSP_MISC_CHAN_TIMER_PWM_HEAT_E2;
      break;
    case 3:
      pHTim = &hTimPwmHeatE3;
      channel = BSP_MISC_CHAN_TIMER_PWM_HEAT_E3;
      break;
#endif//BSP_HEAT_E2_PIN
#ifdef BSP_HEAT_BED2_PIN
    case 5:
      pHTim = &hTimPwmHeatBed2;
      channel = BSP_MISC_CHAN_TIMER_PWM_HEAT_BED2;
      break;
    case 6:
      pHTim = &hTimPwmHeatBed3;
      channel = BSP_MISC_CHAN_TIMER_PWM_HEAT_BED3;
      break;
#endif
  }
  
  if (newDuty == 0) 
  {
    pulse = 0 ;
  }
  else 
  {
    pulse = pHTim->Init.Period * newDuty /255 + 1;
  }      
  __HAL_TIM_SetCompare(pHTim, channel, pulse);
}


/******************************************************//**
 * @brief  Initialize the Pwm used to control the servo motor
 * @param[in] pwmFreq frequency in Hz of the PWM 
 * @retval None
 * @note None
 **********************************************************/
#ifdef BSP_SERVO0_PIN
void  BSP_MotorControlBoard_ServoInit(void)
{
  static TIM_OC_InitTypeDef sConfigOC;
  static TIM_MasterConfigTypeDef sMasterConfig;
  static TIM_ClockConfigTypeDef sClockSourceConfig;
  GPIO_InitTypeDef GPIO_InitStruct;
  TIM_HandleTypeDef *pHTim = NULL;
  uint32_t channel;
  
  pHTim = &hTimServo;
  pHTim->Instance = BSP_MISC_TIMER_SERVO;
  pHTim->Init.Prescaler = SERVO_TIMER_PRESCALER - 1;
  pHTim->Init.Period = 0;
  channel = BSP_MISC_CHAN_TIMER_SERVO;
  pHTim->Init.CounterMode = TIM_COUNTERMODE_UP;
  pHTim->Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
  HAL_TIM_OC_Init(pHTim);  

  sClockSourceConfig.ClockSource = TIM_CLOCKSOURCE_INTERNAL;
  HAL_TIM_ConfigClockSource(pHTim, &sClockSourceConfig); 
  
  sConfigOC.OCMode = TIM_OCMODE_TIMING;
  sConfigOC.Pulse = 0;
  sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
  sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
  HAL_TIM_OC_ConfigChannel(pHTim, &sConfigOC, channel);

  sMasterConfig.MasterOutputTrigger = TIM_TRGO_RESET;
  sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
  HAL_TIMEx_MasterConfigSynchronization(pHTim, &sMasterConfig);
  
  GPIO_InitStruct.Pin = BSP_SERVO0_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_MEDIUM;
  HAL_GPIO_Init(BSP_SERVO0_PORT, &GPIO_InitStruct);      
  HAL_GPIO_WritePin(BSP_SERVO0_PORT, BSP_SERVO0_PIN, GPIO_PIN_RESET);   
}
/******************************************************//**
 * @brief  Set the value of the Servo motor
 * @param[in] value
 * @retval None
 * @note None
 **********************************************************/
void  BSP_MotorControlBoard_ServoSetTimerValue(uint32_t value)
{
  __HAL_TIM_SET_AUTORELOAD(&hTimServo, value - 1);
  HAL_TIM_OC_Start_IT(&hTimServo, BSP_MISC_CHAN_TIMER_SERVO);
}
/******************************************************//**
 * @brief  Stop the timer used by the servo
 * @param None
 * @retval None
 * @note None
 **********************************************************/
void  BSP_MotorControlBoard_ServoStop(void)
{
	//TODO: disable sevo support
  HAL_NVIC_ClearPendingIRQ(BSP_MISC_SERVO_IRQn);
  HAL_TIM_OC_Stop_IT(&hTimServo, BSP_MISC_CHAN_TIMER_SERVO);
  HAL_GPIO_WritePin(BSP_SERVO0_PORT, BSP_SERVO0_PIN, GPIO_PIN_SET);   
}
#endif
/******************************************************//**
 * @brief  Initialisation of the user GPIOs
 * @param[in] id 0 for USER_1, 1 for USER_2, 2 for USER_3, 3 for USER_4
 * @param[in] mode GPIO_MODE_INPUT, GPIO_MODE_OUTPUT_PP ... look at definitions 
 * in stm32f0xx_hal_gpio.h
 * @param[in] pull GPIO_NOPULL, GPIO_PULLUP, GPIO_PULLDOWN
 * @retval None
 **********************************************************/
#ifdef BSP_USER_1_PIN
void BSP_MiscUserGpioInit(uint8_t id, uint32_t mode, uint32_t pull)
{
  GPIO_InitTypeDef GPIO_InitStruct;
  uint32_t gpioPin;
  GPIO_TypeDef* gpioPort;

  switch (id)
  {
    case 0:
      /* Configure user 1 pin */
      gpioPin = BSP_USER_1_PIN;
      gpioPort = BSP_USER_1_PORT;    
      break;
    case 1:
      /* Configure user 2 pin */
      gpioPin = BSP_USER_2_PIN;
      gpioPort = BSP_USER_2_PORT;      
      break;      
    case 2:
      /* Configure user 3 pin */
      gpioPin = BSP_USER_3_PIN;
      gpioPort = BSP_USER_3_PORT;       
      break;   
    case 3:
      /* Configure user 4 pin */
      gpioPin = BSP_USER_4_PIN;
      gpioPort = BSP_USER_4_PORT;      
      break;  
    default:
      return;
  }
  GPIO_InitStruct.Pin = gpioPin;
  GPIO_InitStruct.Mode = mode;
  GPIO_InitStruct.Pull = pull;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_MEDIUM;
  HAL_GPIO_Init(gpioPort, &GPIO_InitStruct);      
}
#endif


/**
  * @}
  */    

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
